Employee_Pension_Contribution[
    {
        "Field Name/Comment": "Description",
        "Record_Type": "Unique id of the type of record - in this instance ‘01’ will be used to identify RTI payment records found for an individual with Universal Credit Interest set that fall within a period of interest and have not been previously passed to DWP.",
        "Tax Year": "The tax year to which the earnings information in this record applies. In the majority of cases this will be the current tax year, but the policy period supplied in the request may well push into the previous tax year.",
        "Tax Year Indicator ": "One of the following values:\r\n\r\n‘C’ – earnings are for the current tax year\r\n‘P’ – earnings are for the previous tax year ",
        "HMRC_Office_Number": "HMRC Office Number",
        "Employer_PAYE_Ref": "Unique identifier for the Scheme making the payment.",
        "Employer Name 1": "Name of the Scheme employing the individual.",
        "Employer Name 2": "",
        "Employer Trade_Name 1": "Trade name of the Scheme employing the individual.",
        "Employer Trade Name 2": "",
        "NINO": "National Insurance number.  The NINO of the Individual for which the Payment Data is being issued. This is the NINO to which the payment data has been matched and does not necessarily correspond to the NINO provided on the Payment Data.",
        "Surname": "Surname or family name",
        "Forename": "Forename or given name",
        "Second_Forename": "Second forename for the claimant",
        "Initials": "Initial of person.",
        "Date_Of_Birth": "Date of birth for the claimant",
        "Gender": "Gender",
        "Unique Employment Sequence Number": "NPS Emp Seq No\r\n",
        "Payroll Id": "Identifier assigned by the employer to the individual.",
        "Employment_Start_Date": "Start Date of the Employment for which the Payment Data relates.",
        "Employment_End_Date": "End Date of the Employment for which the Payment Data relates.",
        "Taxable_Pay": "Taxable pay in this pay period including payrolled benefits in kind",
        "Value_of_payments": "Value of payments not subject to tax or NICs in pay period",
        "Value_of_deductions_from_net_pay": "Value of deductions from net pay in pay period",
        "Pay_after_statutory_deductions": "Pay after statutory deductions",
        "Value_of_benefits": "Value of benefits taxed via the payroll in pay period",
        "Value_of_employee_pension": "Value of employee pension contributions paid under \"net pay arrangements\" in pay period",
        "Items_subject_to_tax_or_NIC": "Items subject to Class 1 NIC but not taxed under PAYE regulations excluding pension contributions in pay period",
        "Value_of_pension": "Value of employee pension contributions that are not paid under a net pay arrangement",
        "Value_of_tax_deducted": "Value of tax deducted or refunded from this payment",
        "Gross_earnings_for_NICs": "Gross earnings for NICs in this pay period",
        "Employees_contributions": "Employees contributions due on all earnings in this pay period",
        "Taxable_pay_to_date": "Taxable pay to date in this employment including payrolled benefits in kind",
        "Total_tax_to_date": "Total tax to date in this employment",
        "Employees_contributions_due": "Employees contributions due on all earnings year to date",
        "Number_of_normal_hours": "Number of normal hours worked\r\n",
        "Pay_Frequency": "Payment frequency",
        "Payment_Date": "Date of the payment ",
        "Tax_Week_No": "Weekly Period Number",
        "Tax_Month_No": "Monthly Period Number",
        "Number_of_earnings_period(s)": "Number of earnings period(s) covered by payment",
        "Indicator that the payment is a payment after date of notification of contract ending": "",
        "Irregular_Payment_Indicator": "Irregular Employment Payment Pattern indicator",
        "Merger_Indicator": "Merger Indicator",
        "Unique_Payment_Id": "Unique Payment identifier",
        "Payment_Confidence_Status": "Indicates the status of a Payment \r\n",
        "Occupational_Pension_Indicator": "Occupational Pension Indicator",
        "On_Strike_Indicator": "Identification That An Individual Has Been On Strike Within The RTI Payment Period",
        "Unpaid_Absence_Indicator": "Identification That An Individual Has Been On Unpaid Absence Within The RTI Payment Period",
        "Benefits_Value": "Value of Benefits Taxed Via The Payroll YTD",
        "Employee_Pension_Contribution": "Value of Employee Pension Contributions Paid Under Net Pay Arrangements YTD",
        "Pension_Not_Paid_under_net_pay": "Value of Employee Pension Contributions That Are Not Paid Under Net Pay Arrangements YTD",
        "Tax_Code_Operated": "Tax Code Operated On This Payment",
        "Mutliple IPS Indicator": "Value “Y” – Multiple IPS records used to determine payment confidence status of ‘Payment Confirmed Amount Differs’\r\nValue “N” – Single IPS record used to determine payment confidence status of ‘Payment Confirmed Amount",
        "BACS Payment Amount": "The BACS payment amount (in pence) used in determining the payment confidence status. This is only provided where payment confidence status is ‘Payment Confirmed Amount Differs’\r\n\r\nAn empty field will be supplied if the above conditions are not met.",
        "Statutory Maternity Pay YTD": "0.00 thru 999999.99 – mandatory 2 decimal places.",
        "NI Letter": "If present, can take one of the letter values: A,B,C,D,E,I,J,K,L,M,N,O,P,Q,R,T,V,W,X,Y or Z.",
        "Director’s NIC": "Value “AN” – Annual\r\nValue “AL” – Alternative",
        "Late PAYE Reporting Reason": "Value \"A\" - \"Notional payment: Payment to Expat by third party or overseas employer\"\r\nValue \"B\" - \"Notional payment: Employment related security\"\r\nValue \"C\" - \"Notional payment: Other\"\r\nValue \"D\" - \"Payment subject to Class 1 NICs but P11D/P9D for tax\"\r\nValue \"E\" - \"Micro Employer using temporary “on or before” relocation.\r\nValue \"F\" - \"No requirement to maintain a deductions working sheet or impractical to report work done on the day\"\r\nValue \"G\" - \"Reasonable excuse\"\r\nValue \"H\" - Correction to earlier submission\"",
        "Scheme Exempt Indicator": "If present, can take of the following values: Y or N.",
        "Flexibly accessing pension rights": "If present, can take of the following values: Y or N."
    },
    {
        "Field Name/Comment": ""
    }
]
